In [107]:
# Dependencies and Setup
import pandas as pd
import numpy as np

# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file_to_load)
df = purchase_data

df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",$3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,$1.56
2,2,Ithergue48,24,Male,92,Final Critic,$4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,$3.27
4,4,Iskosia90,23,Male,131,Fury,$1.44

In [108]:
# Get a count of the total data set
df.count()

Purchase ID    780
SN             780
Age            780
Gender         780
Item ID        780
Item Name      780
Price          780
dtype: int64

In [109]:
# Check the data types of each column
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 780 entries, 0 to 779
Data columns (total 7 columns):
Purchase ID    780 non-null int64
SN             780 non-null object
Age            780 non-null int64
Gender         780 non-null object
Item ID        780 non-null int64
Item Name      780 non-null object
Price          780 non-null float64
dtypes: float64(1), int64(3), object(3)
memory usage: 33.6+ KB

In [195]:
# Count the unique Screen names
df_sn = df['SN'].nunique()
df_sn

576

In [111]:
# Count the unique items
df1 = df['Item ID'].nunique()
df1

183

In [112]:
# Find the average amount spent
df_avg = df['Price'].mean()

In [113]:
# Find the total revenue made
df_rev = df['Price'].sum()
df_rev

2379.77

In [114]:
# Find the total number of items purchased
df_pur = df['Price'].count()

In [115]:
# Make a new data set to hold the info
dft = {'Unique Players': [df_sn], 'Unique Items': [df1], 'Average Purchase Price': [df_avg], 'Total Purchases': [df_pur], 'Total Revenue': [df_rev]}

In [116]:
# set the data as a data frame and then convert the values with decimals into dolars
df2 = pd.DataFrame(data=dft)
pd.options.display.float_format = '${:,.2f}'.format

In [117]:
df_id = df.sort_values("SN")

In [118]:
df_id.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
467,467,Adairialis76,16,Male,123,Twilight's Carver,$2.28
142,142,Adastirin33,35,Female,175,Woeful Adamantite Claymore,$4.48
388,388,Aeda94,17,Male,128,"Blazeguard, Reach of Eternity",$4.91
28,28,Aela59,21,Male,119,"Stormbringer, Dark Blade of Ending Misery",$4.32
630,630,Aelaria33,23,Male,171,Scalpel,$1.79

In [119]:
df_id = df_id.drop_duplicates('SN')

In [120]:
df_id.count()

Purchase ID    576
SN             576
Age            576
Gender         576
Item ID        576
Item Name      576
Price          576
dtype: int64

In [121]:
df_gender = df_id['Gender'].value_counts()

In [122]:
df_gender

Male                     484
Female                    81
Other / Non-Disclosed     11
Name: Gender, dtype: int64

In [123]:
df_genderpct = (df_gender/576)*100
pd.options.display.float_format = '{:,.2f}%'.format
df_genderpct

Male                    84.03%
Female                  14.06%
Other / Non-Disclosed    1.91%
Name: Gender, dtype: float64

In [124]:
df_gentot= pd.DataFrame({"Count" : df_gender, "Percent" : df_genderpct})

In [125]:
df_gentot

                       Count  Percent
Male                     484   84.03%
Female                    81   14.06%
Other / Non-Disclosed     11    1.91%

In [126]:
mfpurchase = df.groupby('Gender')['Item ID']

In [127]:
mfpurchase = mfpurchase.count()

In [128]:
mfavg = df.groupby('Gender')['Price'].mean()
pd.options.display.float_format = '${:,.2f}'.format

In [129]:
mfavg.round(2)

Gender
Female                  $3.20
Male                    $3.02
Other / Non-Disclosed   $3.35
Name: Price, dtype: float64

In [130]:
mftotal = df.groupby('Gender')['Price'].sum()

In [131]:
mftotal.round(2)

Gender
Female                    $361.94
Male                    $1,967.64
Other / Non-Disclosed      $50.19
Name: Price, dtype: float64

In [132]:
mfdata = pd.DataFrame({"Items Purchased": mfpurchase, 'Average Spent': mfavg, 'Total Spent': mftotal})

In [203]:
mfdata

                       Items Purchased  Average Spent  Total Spent
Gender
Female                             113          $3.20      $361.94
Male                               652          $3.02    $1,967.64
Other / Non-Disclosed               15          $3.35       $50.19

In [272]:
bins = [0,9,14,19,24,29,34,39,45]

group_names = ['Under 10', "10-14", '15-19', '20-24', '25-29', '30-34', '35-39', '40+']

df["Age Group"] = pd.cut(df["Age"], bins, labels=group_names)
df_id["Age Group"] = pd.cut(df["Age"], bins, labels=group_names)

In [273]:
df_id = df_id.drop_duplicates('SN')
df_id.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Group
467,467,Adairialis76,16,Male,123,Twilight's Carver,$2.28,15-19
142,142,Adastirin33,35,Female,175,Woeful Adamantite Claymore,$4.48,35-39
388,388,Aeda94,17,Male,128,"Blazeguard, Reach of Eternity",$4.91,15-19
28,28,Aela59,21,Male,119,"Stormbringer, Dark Blade of Ending Misery",$4.32,20-24
630,630,Aelaria33,23,Male,171,Scalpel,$1.79,20-24

In [274]:
agecount = df_id.groupby('Age Group')['SN'].count()
agecount

Age Group
Under 10     17
10-14        22
15-19       107
20-24       258
25-29        77
30-34        52
35-39        31
40+          12
Name: SN, dtype: int64

In [275]:
agetotal = df.groupby('Age Group')['Item ID'].count()
agetotal

Age Group
Under 10     23
10-14        28
15-19       136
20-24       365
25-29       101
30-34        73
35-39        41
40+          13
Name: Item ID, dtype: int64

In [276]:
ageavg = df.groupby('Age Group')['Price'].mean()

In [277]:
ageavg

Age Group
Under 10   $3.35
10-14      $2.96
15-19      $3.04
20-24      $3.05
25-29      $2.90
30-34      $2.93
35-39      $3.60
40+        $2.94
Name: Price, dtype: float64

In [278]:
agespent = df.groupby('Age Group')['Price'].sum()
agespent

Age Group
Under 10      $77.13
10-14         $82.78
15-19        $412.89
20-24      $1,114.06
25-29        $293.00
30-34        $214.00
35-39        $147.67
40+           $38.24
Name: Price, dtype: float64

In [279]:
agespentavg = agespent/agecount

In [280]:
agespentavg

Age Group
Under 10   $4.54
10-14      $3.76
15-19      $3.86
20-24      $4.32
25-29      $3.81
30-34      $4.12
35-39      $4.76
40+        $3.19
dtype: float64

In [281]:
agesumm = pd.DataFrame({'Purchase Count': agetotal, 'Avg Purchase Price': ageavg, 'Total Purchase Values': agespent, 'Average Per Person': agespentavg})

In [282]:
agesumm

,Purchase Count,Avg Purchase Price,Total Purchase Values,Average Per Person
Age Group,,,,
Under 10,23,$3.35,$77.13,$4.54
10-14,28,$2.96,$82.78,$3.76
15-19,136,$3.04,$412.89,$3.86
20-24,365,$3.05,"$1,114.06",$4.32
25-29,101,$2.90,$293.00,$3.81
30-34,73,$2.93,$214.00,$4.12
35-39,41,$3.60,$147.67,$4.76
40+,13,$2.94,$38.24,$3.19

In [283]:
sncount = df.groupby("SN").count()["Price"]
snavg = df.groupby("SN").mean()["Price"]
sntotal = df.groupby("SN").sum()["Price"]

In [284]:
snsumm = pd.DataFrame({'Count':sncount, 'Average': snavg, 'Total': sntotal})

In [285]:
snsumm.head()

              Count  Average  Total
SN
Adairialis76      1    $2.28  $2.28
Adastirin33       1    $4.48  $4.48
Aeda94            1    $4.91  $4.91
Aela59            1    $4.32  $4.32
Aelaria33         1    $1.79  $1.79

In [286]:
topsn = snsumm.sort_values("Total", ascending=False).head()

In [287]:
topsn

             Count  Average  Total
SN
Lisosia93        5    $3.79 $18.96
Idastidru52      4    $3.86 $15.45
Chamjask73       3    $4.61 $13.83
Iral74           4    $3.40 $13.62
Iskadarya95      3    $4.37 $13.10

In [288]:
itemcount = df.groupby(["Item ID", "Item Name"]).count()["Price"]
itemprice = df.groupby(["Item ID", "Item Name"]).mean()['Price']
itemtotal = df.groupby(["Item ID", "Item Name"]).sum()["Price"]

item_df = pd.DataFrame({'Number of Purchases': itemcount, 'Item Price': itemprice, 'Total Sales': itemtotal})

In [289]:
item_df_purchases = item_df.sort_values("Number of Purchases", ascending=False).head()

In [290]:
item_df.head()

                            Number of Purchases  Item Price  Total Sales
Item ID Item Name
0       Splinter                              4       $1.28        $5.12
1       Crucifer                              3       $3.26        $9.78
2       Verdict                               6       $2.48       $14.88
3       Phantomlight                          6       $2.49       $14.94
4       Bloodlord's Fetish                    5       $1.70        $8.50

In [291]:
item_df_total = item_df.sort_values("Total Sales", ascending=False)

In [292]:
item_df_total.head()

,,Number of Purchases,Item Price,Total Sales
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
82,Nirvana,9,$4.90,$44.10
145,Fiery Glass Crusader,9,$4.58,$41.22
92,Final Critic,8,$4.88,$39.04
103,Singed Scalpel,8,$4.35,$34.80